onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОЛ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ОЛ_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОЛ_СогласованнаяСкидка</name>
    <type>
      <types>DefinedType.ОЛ_ПроцентСкидки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ОплатаОтПокупателя/ОплатаОтПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаОтПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОЛ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ОЛ_КонтактныеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

onec-mid-base-11/src/Documents/ОплатаПоставщику/ОплатаПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПоставщику</name>
  <registerRecords>AccumulationRegister.ЗадолженностьПоставщикам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОЛ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ОЛ_КонтактныеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

onec-mid-base-11/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОЛ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ОЛ_КонтактныеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОЛ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ОЛ_КонтактныеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/CommonModules/ОЛ_ИнтерфейсФормыСервер/Module.bsl
#Область ПрограммныйИнтерфейс 
	
// Добавить на форму дополнителные элементы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура ДобавитьНаФормуДополнителныеЭлементы(Форма) Экспорт
    
    ИмяФормы = Форма.ИмяФормы;
    
    Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда       
        ДополнитьФорму(Форма);
    ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
        ДобавитьКонтактноеЛицо(Форма);
        ПереместитьКонтактноеЛицо(Форма);
    ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
        ДобавитьКонтактноеЛицо(Форма);
        ПереместитьКонтактноеЛицо(Форма);
    ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
        ДобавитьКонтактноеЛицо(Форма);    
    ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда    
        ДобавитьКонтактноеЛицо(Форма);    
    КонецЕсли;
   
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дополнить форму.
// 
// Параметры:
//  Форма - Форма, ФормаКлиентскогоПриложения - Форма
Процедура ДополнитьФорму(Форма)

    ДобавитьКонтактноеЛицо(Форма);      
    
    ДополнитьГруппуШапкаЛево(Форма);
    ДобавитьДопРеквизитыФормы(Форма);
    
КонецПроцедуры

// Добавить контактное лицо.
// 
// Параметры:
//  Форма - Форма, ФормаКлиентскогоПриложения - Форма
Процедура ДобавитьКонтактноеЛицо(Форма)
    
    ДоговорЭлемент = Форма.Элементы.Найти("Договор");
       
    ПолеВвода = Форма.Элементы.Вставить("ОЛ_КонтактноеЛицо", Тип("ПолеФормы"), ДоговорЭлемент.Родитель); 
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
    ПолеВвода.ПутьКДанным = "Объект.ОЛ_КонтактноеЛицо";
       
КонецПроцедуры

// Переместить контактное лицо.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура ПереместитьКонтактноеЛицо(Форма)
    
    КонтактноеЛицоЭлемент = Форма.Элементы.Найти("ОЛ_КонтактноеЛицо");
    Родитель = КонтактноеЛицоЭлемент.Родитель;  
    
    ДоговорЭлемент = Неопределено;   
    
    ИскомыйЭлемент = Неопределено;
    Для Каждого ПодчиненныйЭлемент Из Родитель.ПодчиненныеЭлементы Цикл
        
        Если ДоговорЭлемент <> Неопределено Тогда
            ИскомыйЭлемент = ПодчиненныйЭлемент; 
            Прервать;
        КонецЕсли;    
            
        Если ПодчиненныйЭлемент.Имя = "Договор" Тогда          
            ДоговорЭлемент = ПодчиненныйЭлемент;    
        КонецЕсли;
    
    КонецЦикла;
    Форма.Элементы.Переместить(КонтактноеЛицоЭлемент, КонтактноеЛицоЭлемент.Родитель, ИскомыйЭлемент); 	
    
КонецПроцедуры

// Дополнить группу шапка лево.
// 
// Параметры:
//  Форма - Форма, ФормаКлиентскогоПриложения - Форма
Процедура ДополнитьГруппуШапкаЛево(Форма)
    
    //Добавим группу Согл скидка
    Группа = Форма.Элементы.Вставить("ОЛ_ГруппаСоглСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
    Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    //@skip-check wrong-type-expression
    Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
    Группа.ОтображатьЗаголовок = Ложь;
    Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
    
    //Добавим реквизит СогласованнаяСкидка 
    ПолеВвода = Форма.Элементы.Добавить("ОЛ_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ОЛ_ГруппаСоглСкидка); 
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
    ПолеВвода.ПутьКДанным = "Объект.ОЛ_СогласованнаяСкидка";	
    //@skip-check module-attachable-event-handler-name
    ПолеВвода.УстановитьДействие("ПриИзменении", "ОЛ_СогласованнаяСкидкаПриИзменении");
    
    //Добавим команду
    НоваяКоманда_ПересчитатьСоСкидкой = Форма.Команды.Добавить("ОЛ_ПересчитатьСУчетомСкидки");
    НоваяКоманда_ПересчитатьСоСкидкой.Заголовок = "Пересчитать";
    НоваяКоманда_ПересчитатьСоСкидкой.Действие = "ОЛ_ПересчитатьСУчетомСкидки";
    
    Кнопка = Форма.Элементы.Добавить("ОЛ_ПересчитатьСУчетомСкидки", Тип("КнопкаФормы"), Форма.Элементы.ОЛ_ГруппаСоглСкидка);
    Кнопка.ИмяКоманды = "ОЛ_ПересчитатьСУчетомСкидки";
    
КонецПроцедуры 

// Добавить доп реквизиты формы.
// 
// Параметры:
//  Форма - Форма, ФормаКлиентскогоПриложения - Форма
Процедура ДобавитьДопРеквизитыФормы(Форма)

    МассивНовыхРеквизитов = Новый Массив;
    
    НовыйРеквизит = Новый РеквизитФормы("ИменаТЧ", Новый ОписаниеТипов("СписокЗначений"));	
    МассивНовыхРеквизитов.Добавить(НовыйРеквизит);
    
    Форма.ИзменитьРеквизиты(МассивНовыхРеквизитов);
    
КонецПроцедуры

#КонецОбласти
